sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/third_party/exactle/sw/hci/ambiq/da14581/hci_drv_da14581.c
            }
            else
            {
                //
                // If the shutdown failed, then both our UART and the Dialog
                // UART are on. Go ahead and send the message.
                //
                bSuccess = true;
            }
        }

        //
        // If we succeeded, send the type packet before we exit the critical
        // section. Otherwise, just exit the critical section and continue the
        // loop.
        //
        if (bSuccess)
        {
            am_hal_uart_char_transmit_polled(g_ui32UartModule, type);
            WSF_CS_EXIT(cs);
            break;
        }
        else
        {
            WSF_CS_EXIT(cs);
        }
    }

    //
    // Start sending bytes.
    //
    while (ui16Count < len)
    {
        //
        // Check the fifo fullness.
        //
        if(AM_BFRn(UART, 0, FR, TXFF))
        {
            //
            // If it was full, sleep until we can reasonably expect it to be
            // empty.
            //
            HCI_DRV_SLEEP;
        }
        else
        {
            //
            // If it wasn't full, we should put our data in it.
            //
            AM_REGn(UART, 0, DR) = *pData++;
            ui16Count++;
        }
    }

    return ui16Count;
}

//*****************************************************************************
//
// hciDrvReadyToSleep - Stub provided to allow other layers to run correctly.
//
//*****************************************************************************
bool_t
hciDrvReadyToSleep(void)
{
    return TRUE;
}

//*****************************************************************************
//
// Configure the necessary pins and start the Dialog radio.
//
//*****************************************************************************
void
HciDrvRadioBoot(uint32_t ui32UartModule)
{
    //
    // Enable the radio pins.
    //
    #ifdef HCI_APOLLO_POWER_PIN
    am_hal_gpio_pin_config(HCI_APOLLO_POWER_PIN, HCI_APOLLO_POWER_CFG);
    am_hal_gpio_out_bit_set(HCI_APOLLO_POWER_PIN);
    #endif

    //
    // Assert RESET to the Dialog device.
    //
    am_hal_gpio_pin_config(HCI_APOLLO_RESET_PIN, AM_HAL_GPIO_OUTPUT);
    am_hal_gpio_out_bit_set(HCI_APOLLO_RESET_PIN);

    //
    // Configure the UART pins.
    //
    am_hal_gpio_pin_config(HCI_APOLLO_UART_TX_PIN, HCI_APOLLO_UART_TX_CFG);
    am_hal_gpio_pin_config(HCI_APOLLO_UART_RX_PIN, HCI_APOLLO_UART_RX_CFG);
    am_hal_gpio_pin_config(HCI_APOLLO_UART_RTS_PIN, AM_HAL_PIN_OUTPUT);
    am_hal_gpio_pin_config(HCI_APOLLO_UART_CTS_PIN, AM_HAL_PIN_INPUT);

    g_sUartConfig.ui32BaudRate = 112000;
    g_sUartConfig.ui32DataBits = AM_HAL_UART_DATA_BITS_8;
    g_sUartConfig.bTwoStopBits = false;
    g_sUartConfig.ui32Parity = AM_HAL_UART_PARITY_NONE;
    g_sUartConfig.ui32FlowCtrl = AM_HAL_UART_FLOW_CTRL_NONE;

    //
    // Save the device instance module
    //
    g_ui32UartModule = ui32UartModule;

    //
    // Enable UART FIFO operation.
    //
    am_hal_uart_pwrctrl_enable(g_ui32UartModule);
    am_hal_uart_clock_enable(g_ui32UartModule);
    am_hal_uart_disable(g_ui32UartModule);
    am_hal_uart_config(g_ui32UartModule, &g_sUartConfig);
    am_hal_uart_enable(g_ui32UartModule);

    am_hal_uart_fifo_config(g_ui32UartModule,
                            AM_HAL_UART_TX_FIFO_1_2 | AM_HAL_UART_RX_FIFO_1_2);

    //
    // Force RTS low
    //
    am_hal_gpio_pin_config(HCI_APOLLO_UART_RTS_PIN, AM_HAL_PIN_OUTPUT);
    am_hal_gpio_out_bit_clear(HCI_APOLLO_UART_RTS_PIN);

    //
    // Delay a bit.
    //
    am_util_delay_ms(10);

    //
    // Deassert RESET to the Dialog device.
    //
    am_hal_gpio_out_bit_clear(HCI_APOLLO_RESET_PIN);
    am_hal_gpio_pin_config(HCI_APOLLO_RESET_PIN, AM_HAL_PIN_DISABLE);

    //
    // Set the MAC address. Use the CHIPID1 register for additional
    // randomization if the config file requested it.
    //
    if (HCI_APOLLO_USE_CHIPID_FOR_MAC)
    {
        g_pui8BLEMacAddress[0] = AM_REG(MCUCTRL, CHIPID1);
        g_pui8BLEMacAddress[1] = AM_REG(MCUCTRL, CHIPID1) >> 8;
        g_pui8BLEMacAddress[2] = AM_REG(MCUCTRL, CHIPID1) >> 16;
    }

    am_devices_da14581_mac_set(g_pui8BLEMacAddress);

    //
    // Transmit the Dialog firmware image across the PMOD UART port.
    //
    am_devices_da14581_uart_boot(g_pui8Da14581HciImage, DA14581_HCI_IMAGE_LENGTH,
                                 g_ui32UartModule);

    g_sUartConfig.ui32BaudRate = 250000;
    g_sUartConfig.ui32DataBits = AM_HAL_UART_DATA_BITS_8;
    g_sUartConfig.bTwoStopBits = false;
    g_sUartConfig.ui32Parity = AM_HAL_UART_PARITY_NONE;
    g_sUartConfig.ui32FlowCtrl = AM_HAL_UART_FLOW_CTRL_NONE;

    am_hal_uart_disable(g_ui32UartModule);
    am_hal_uart_config(g_ui32UartModule, &g_sUartConfig);
    am_hal_uart_enable(g_ui32UartModule);

#if AM_CMSIS_REGS
    //
    // Clear any UART errors that may have come up in the reboot process.
    //
    uint32_t ui32Status = UART->IES;
    UART->IEC = ui32Status;

    //
    // Enable the UART and RX timeout interrupt.
    //
    UART0->IER) |= (UART_IES_RTRIS_Msk  |
                    UART_IES_RXRIS_Msk  |
                    UART_IES_TXRIS_Msk);

    //
    // Enable the UART and GPIO interrupt handlers.
    //
    NVIC_EnableIRQ(UART0_IRQn);
    NVIC_EnableIRQ(GPIO_IRQn);
#else // AM_CMSIS_REGS
    //
    // Clear any UART errors that may have come up in the reboot process.
    //
    uint32_t ui32Status = AM_REG(UART, IES);
    AM_REG(UART, IEC) = ui32Status;

    //
    // Enable the UART and RX timeout interrupt.
    //
    AM_REGn(UART, 0, IER) |= (AM_REG_UART_IES_RTRIS_M |
                              AM_REG_UART_IES_RXRIS_M |
                              AM_REG_UART_IES_TXRIS_M);

    //
    // Enable the UART and GPIO interrupt handlers.
    //
    am_hal_interrupt_enable(AM_HAL_INTERRUPT_UART);
    am_hal_interrupt_enable(AM_HAL_INTERRUPT_GPIO);
#endif // AM_CMSIS_REGS

    //
    // Delay for 3 seconds to make sure the dialog goes to sleep.
    //
    am_util_delay_ms(20);
}

void
HciDrvRadioShutdown(void)
{
    // TODO
}

//*****************************************************************************
//
// Performs the functions required for handing UART interrupts for the ISR
// connection to the radio.
//
//*****************************************************************************
void
HciDrvUartISR(uint32_t ui32Status)
{
    //
    // Check to see if we have filled the Rx FIFO past the configured limit, or
    // if we have an 'old' character or two sitting in the FIFO.
    //
    if (ui32Status & (AM_REG_UART_IES_RXRIS_M | AM_REG_UART_IES_RTRIS_M))
    {
        //
        // While there's stuff in the RX fifo....
        //
        while (!AM_BFRn(UART, 0, FR, RXFE))
        {
            //
            // Read a byte from the FIFO.
            //
            uint32_t ui32Char = AM_REGn(UART, 0, DR);

            //
            // If none of the error bits are set (stored in the bits just above
            // the data byte), send the byte along to the HCI layer.
            //
            if ((ui32Char & 0x700) == 0)
            {
                //
                // Pass it along to the HCI driver.
                //
                hciTrSerialRxIncoming((uint8_t *)(&ui32Char), 1);
            }
        }
    }
}

#if (HCI_APOLLO_CFG_OVERRIDE_ISR == 0)
//*****************************************************************************
//
// UART interrupt handler.
//
//*****************************************************************************
void
am_uart_isr(void)
{
    uint32_t ui32Status;

    //
    // Read and save the interrupt status, but clear out the status register.
    //
    ui32Status = AM_REGn(UART, 0, MIS);
    AM_REGn(UART, 0, IEC) = ui32Status;

    //
    // Run the standard HCI interrupt routine
    //
    HciDrvUartISR(ui32Status);
}
#endif
